; domain
(define (domain gripper_x_1-domain)
 (:requirements :strips :typing)
 (:types room ball gripper)
 (:predicates (at_robby ?r - room) (at_ ?b - ball ?r - room) (free ?g - gripper) (carry ?o - ball ?g - gripper))
 (:action move
  :parameters ( ?from - room ?to - room)
  :precondition (and (at_robby ?from))
  :effect (and (at_robby ?to) (not (at_robby ?from))))
 (:action pick
  :parameters ( ?obj - ball ?room - room ?gripper - gripper)
  :precondition (and (at_ ?obj ?room) (at_robby ?room) (free ?gripper))
  :effect (and (carry ?obj ?gripper) (not (at_ ?obj ?room)) (not (free ?gripper))))
 (:action drop
  :parameters ( ?obj - ball ?room - room ?gripper - gripper)
  :precondition (and (carry ?obj ?gripper) (at_robby ?room))
  :effect (and (at_ ?obj ?room) (free ?gripper) (not (carry ?obj ?gripper))))
)

; problem
(define (problem gripper_x_1-problem)
 (:domain gripper_x_1-domain)
 (:objects
   rooma roomb - room
   ball4 ball3 ball2 ball1 - ball
   left right - gripper
 )
 (:init (at_robby rooma) (free left) (free right) (at_ ball4 rooma) (at_ ball3 rooma) (at_ ball2 rooma) (at_ ball1 rooma))
 (:goal (and (at_ ball4 roomb) (at_ ball3 roomb) (at_ ball2 roomb) (at_ ball1 roomb)))
)

; plan
1. (pick ball4 rooma left)
   deleted: (at_ ball4 rooma) (free left)
   added: (carry ball4 left)
   goals met: 0 of 4
2. (move rooma roomb)
   deleted: (at_robby rooma)
   added: (at_robby roomb)
   goals met: 0 of 4
3. (drop ball4 roomb left)
   deleted: (carry ball4 left)
   added: (at_ ball4 roomb) (free left)
   goals met: 1 of 4
4. (move roomb rooma)
   deleted: (at_robby roomb)
   added: (at_robby rooma)
   goals met: 1 of 4
5. (pick ball3 rooma left)
   deleted: (at_ ball3 rooma) (free left)
   added: (carry ball3 left)
   goals met: 1 of 4
6. (pick ball2 rooma right)
   deleted: (at_ ball2 rooma) (free right)
   added: (carry ball2 right)
   goals met: 1 of 4
7. (move rooma roomb)
   deleted: (at_robby rooma)
   added: (at_robby roomb)
   goals met: 1 of 4
8. (drop ball3 roomb left)
   deleted: (carry ball3 left)
   added: (at_ ball3 roomb) (free left)
   goals met: 2 of 4
9. (drop ball2 roomb right)
   deleted: (carry ball2 right)
   added: (at_ ball2 roomb) (free right)
   goals met: 3 of 4
10. (move roomb rooma)
   deleted: (at_robby roomb)
   added: (at_robby rooma)
   goals met: 3 of 4
11. (pick ball1 rooma left)
   deleted: (at_ ball1 rooma) (free left)
   added: (carry ball1 left)
   goals met: 3 of 4
12. (move rooma roomb)
   deleted: (at_robby rooma)
   added: (at_robby roomb)
   goals met: 3 of 4
13. (drop ball1 roomb left)
   deleted: (carry ball1 left)
   added: (at_ ball1 roomb) (free left)
   goals met: 4 of 4
